cfd/cases/fluke_L0/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}

defaultFieldValues ( volScalarFieldValue zoneID 123 );
regions
(
    cellToCell { set c0; fieldValues ( volScalarFieldValue zoneID 0 ); }
    cellToCell { set c1; fieldValues ( volScalarFieldValue zoneID 1 ); }
);
